RickKimball/msp430m0/msp430m0.c
//--------------------------------------------------------------------------
// msp430m0.c - turn a fast msp430fr6989 into a slow msp430m0 w/thumbulator
/*--------------------------------------------------------------------------
   based on: https://github.com/dwelch67/thumbulator
   see copyright at bottom of file
 */

#include <msp430.h>
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

uint32_t read32 ( uint32_t );
uint32_t read_register ( uint32_t );

#define ROMADDMASK 0x7fffL /* 32k */
#define RAMADDMASK 0x7fffL /* 16k */

#define ROMSIZE (ROMADDMASK+1)
#define RAMSIZE (RAMADDMASK+1)

__attribute__((section(".m0rom.bss")))
uint16_t rom[ROMSIZE>>1];

__attribute__((section(".m0ram.bss")))
uint16_t ram[RAMSIZE>>1];

#define CPSR_N (1L<<31)
#define CPSR_Z (1L<<30)
#define CPSR_C (1L<<29)
#define CPSR_V (1L<<28)
#define CPSR_Q (1L<<27)

uint32_t vcdcount;
uint32_t output_vcd;
FILE *fpvcd;

uint32_t systick_ctrl;
uint32_t systick_reload;
uint32_t systick_count;
uint32_t systick_calibrate;

uint32_t halfadd;
uint32_t cpsr;
uint32_t handler_mode;
uint32_t reg_norm[16]; //normal execution mode, do not have a thread mode

uint32_t instructions;
uint32_t fetches;
uint32_t reads;
uint32_t writes;
uint32_t systick_ints;



//-------------------------------------------------------------------
void dump_counters ( void )
{
#if 0
    printf("\n\n");
    printf("instructions %lu\n",instructions);
    printf("fetches      %lu\n",fetches);
    printf("reads        %lu\n",reads);
    printf("writes       %lu\n",writes);
    printf("memcycles    %lu\n",fetches+reads+writes);
    printf("systick_ints %lu\n",systick_ints);
#endif
}
//-------------------------------------------------------------------
uint32_t fetch16 ( uint32_t addr )
{
    uint32_t data;

    fetches++;

    switch(addr&0xF0000000)
    {
        case 0x00000000: //ROM
            addr&=ROMADDMASK;
            addr>>=1;
            data=rom[addr];
            return(data);

        case 0x20000000: //RAM
            addr&=RAMADDMASK;
            addr>>=1;
            data=ram[addr];
            return(data);
    }
    while(1); // fprintf(stderr,"fetch16(0x%08lX), abort pc = 0x%04lX\n",addr,read_register(15));
}
//-------------------------------------------------------------------
uint32_t fetch32 ( uint32_t addr )
{
    uint32_t data;

    _NOP();

    switch(addr&0xF0000000)
    {
        case 0x00000000: //ROM
            if(addr<0x50)
            {
                data=read32(addr);
                if(addr==0x00000000) return(data);
                if(addr==0x00000004) return(data);
                if(addr==0x0000003C) return(data);
                while(1); // fprintf(stderr,"fetch32(0x%08lX), abort pc = 0x%04lX\n",addr,read_register(15));
            }
        case 0x20000000: //RAM
            //data=fetch16(addr+0);
            //data|=((uint32_t)fetch16(addr+2))<<16;
            data=read32(addr);
            return(data);
    }
    while(1); //fprintf(stderr,"fetch32(0x%08lX), abort pc 0x%04lX\n",addr,read_register(15));
}
//-------------------------------------------------------------------
void write16 ( uint32_t addr, uint32_t data )
{

    writes++;


    switch(addr&0xF0000000)
    {
        case 0x20000000: //RAM
            addr&=RAMADDMASK;
            addr>>=1;
            ram[addr]=data&0xFFFF;
            return;
    }
    while(1); // fprintf(stderr,"write16(0x%08lX,0x%04lX), abort pc 0x%04lX\n",addr,data,read_register(15));
}
//-------------------------------------------------------------------
void write32 ( uint32_t addr, uint32_t data )
{
    switch(addr&0xF0000000) {
    case 0xF0000000: //halt
        dump_counters();
        exit(0);

    case 0xE0000000: //periph
        if ( 0 )
            ;
        else if ( addr == 0xE000E010L ) {
            uint32_t old;

            old=systick_ctrl;
            systick_ctrl = data&0x00010007;
            if(((old&1)==0)&&(systick_ctrl&1))
            {
            //timer started, load count
            systick_count=systick_reload;
            }
        }
        else if ( addr == 0xE000E014UL ) {
            systick_reload=data&0x00FFFFFF;
        }
        else if ( addr == 0xE000E018UL ) {
            systick_count=data&0x00FFFFFF;
        }
        else if ( addr == 0xE000E01CUL ) {
            systick_calibrate=data&0x00FFFFFF;
        }
        return;

#if 0
    case 0xD0000000: //debug
        switch(addr&0xFF) {
        case 0x00:
            {
            fprintf(stderr,"[0x%08lX][0x%08lX] 0x%08lX\n",read_register(14),addr,data);
            return;
            }
        case 0x10:
            {
            printf("0x%08lX ",data);
            return;
            }
        case 0x20:
            {
            printf("0x%08lX\n",data);
            return;
            }
        }
 #endif

    case 0x20000000: //RAM
        write16(addr+0,(data>> 0)&0xFFFF);
        write16(addr+2,(data>>16)&0xFFFF);
        return;

    case 0x40000000:  // peripherals
        if ( 0 )
            ;
        else if ( addr == 0x40001004L ) {
            uint8_t t = data & 0xffff;
            PAOUT = t;
            return;
        }
        else if ( addr == 0x40001008L ) {
            uint8_t t = data & 0xffff;
            PADIR = t;
            return;
        }
    }
    while(1); //fprintf(stderr,"write32(0x%08lX,0x%08lX), abort pc 0x%04lX\n",addr,data,read_register(15));
}
//-----------------------------------------------------------------
uint32_t read16 ( uint32_t addr )
{
    uint32_t data;

    reads++;

    switch(addr&0xF0000000)
    {
        case 0x00000000: //ROM
            addr&=ROMADDMASK;
            addr>>=1;
            data=rom[addr];
            return(data);
        case 0x20000000: //RAM
            addr&=RAMADDMASK;
            addr>>=1;
            data=ram[addr];
            return(data);
    }
    while(1); //fprintf(stderr,"read16(0x%08lX), abort pc 0x%04lX\n",addr,read_register(15));
}
//-------------------------------------------------------------------
uint32_t read32 ( uint32_t addr )
{
    uint32_t data;

    _NOP();

    switch(addr&0xF0000000)
    {
        case 0x00000000: //ROM
        case 0x20000000: //RAM
            data =read16(addr+0);
            data|=((uint32_t)read16(addr+2))<<16;
            return(data);

        case 0x40000000:  // peripherals
            if ( 0 )
                ;
            else if ( addr == 0x40001004UL ) {
                data = PAOUT;
                return(data);
            }
            else if ( addr == 0x40001008UL ) {
                data = PADIR;
                return(data);
            }
            break;

